external/swak/examples/BasicSourceSubclasses/pitzDailyWithSwirl/constant/sourcesProperties
/*---------------------------------------------------------------------------*
Caelus 6.10
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      sourcesProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

swirl
{
    type vectorSwakSetValue;

    active true;
    timeStart 0;
    duration 1e7;
    selectionMode all;

    vectorSwakSetValueCoeffs {
        useMaskExpression true;
        maskExpression "mag(pos()-center)<radius";

        variables (
            "speed=1000;"
            "center=vector(0.05,0,0);"
            "radius=0.015;"
        );

        expressions {
            U "vector(0,0,speed)^(pos()-center)";
        }
    }
}


// ************************************************************************* //
